app/views/articles/index.html.slim

    article = article.content
    p <b> Author: </b> #{article.user.email} (created_at: #{article.created_at.day}.#{article.created_at.month}.#{article.created_at.year})
    -if current_user && UserArticles.where(:articles_id => article.id, :user_id => session[:user_id]).count == 0
---
INSERT INTO `user_articles` (`articles_id`, `created_at`, `updated_at`, `user_id`) VALUES (6, '2013-04-14 17:50:28', '2013-04-14 17:50:28', 3)
SELECT COUNT(*) FROM `user_articles` WHERE `user_articles`.`articles_id` = 1 AND `user_articles`.`user_id` = 3