app/controllers/articles_controller.rb

  def vote
    if current_user && UserArticles.where(:articles_id=>params[:id], :user_id=>current_user.id).count==0
      UserArticles.create(:articles_id=>params[:id], :user_id=>current_user.id)
      @articles=Article.find(params[:id])
      @articles.update_attributes(:rating => @articles.rating + 1)
---
SELECT COUNT(*) FROM `user_articles` WHERE `user_articles`.`articles_id` = 1 AND `user_articles`.`user_id` = 3
INSERT INTO `user_articles` (`articles_id`, `created_at`, `updated_at`, `user_id`) VALUES (1, '2013-06-03 12:43:15', '2013-06-03 12:43:15', 1)
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 ORDER BY rating DESC, created_at DESC LIMIT 1
UPDATE `articles` SET `rating` = 24, `updated_at` = '2013-06-03 12:43:15' WHERE `articles`.`id` = 1