app/controllers/articles_controller.rb

SELECT COUNT(*) FROM `user_articles` WHERE `user_articles`.`articles_id` = 1 AND `user_articles`.`user_id` = 3
INSERT INTO `user_articles` (`articles_id`, `created_at`, `updated_at`, `user_id`) VALUES (5, '2013-04-14 18:02:16', '2013-04-14 18:02:16', 3)
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 5 ORDER BY rating DESC, created_at DESC LIMIT 1
UPDATE `articles` SET `rating` = 1, `updated_at` = '2013-04-14 18:02:16' WHERE `articles`.`id` = 5
SELECT `articles`.* FROM `articles` user ORDER BY rating DESC, created_at DESC
---
  def index
    if params[:articles_id] && params[:user_id] && UserArticles.where(:articles_id=>params[:articles_id], :user_id=>params[:user_id]).count==0
      UserArticles.create(:articles_id=>params[:articles_id], :user_id=>params[:user_id])
      @articles=Article.find(params[:articles_id])
      @articles.update_attributes(:rating => @articles.rating + 1)
    end

    @articles = Article.all

SELECT `articles`.* FROM `articles` WHERE `articles`.`user_id` = 3 ORDER BY rating DESC, created_at DESC
---
  def my_articles
    @articles = Article.where(:user_id =>params[:user_id])

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 ORDER BY rating DESC, created_at DESC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
  def show
    @article = Article.find(params[:id])
    @user = User.find(@article.user_id)

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 ORDER BY rating DESC, created_at DESC LIMIT 1
---
  def edit
    @article = Article.find(params[:id])

INSERT INTO `articles` (`content`, `create_date`, `created_at`, `rating`, `title`, `updated_at`, `user_id`) VALUES ('Бла-бла', '2013-04-07 17:46:00', '2013-04-07 17:46:37', NULL, 'Привет!', '2013-04-07 17:46:37', NULL)
---
  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 2 ORDER BY rating DESC, created_at DESC LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 2
---
  def destroy
    @article = Article.find(params[:id])
    @article.destroy