app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`created_at`, `crypted_password`, `email`, `salt`, `updated_at`) VALUES ('2013-04-07 17:37:20', NULL, NULL, NULL, '2013-04-07 17:37:20')